; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v5)
             (pred_4 ?v2 ?v1)
             (pred_9 ?v11 ?v1)
             (pred_11 ?v3 ?v11 )
	     (pred_8 ?v11)
             (pred_5 ?v8)
             (pred_7 ?v2)
             (pred_6 ?v1)
             (pred_12 ?v11)
             (pred_2 ?v2)
             (pred_1 ?v11)
             (pred_3 ))



(:action op_5
:parameters (?v6 ?v10 ?v12 ?v7)
:precondition (and (pred_5 ?v6) (pred_5 ?v10) (pred_7 ?v12) (pred_6 ?v7)
          (pred_10 ?v6 ?v10) (pred_4 ?v12 ?v7)
                   (pred_9 ?v10 ?v7) (pred_8 ?v6) 
                   (pred_12 ?v10) (pred_2 ?v12))
:effect (and  (pred_1 ?v10) (not (pred_12 ?v10))))


(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_5 ?v6) (pred_5 ?v4)
               (pred_8 ?v6) (pred_10 ?v6 ?v4) (pred_1 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v6))))

(:action op_2
:parameters (?v6 ?v12)
:precondition (and (pred_5 ?v6) (pred_7 ?v12) 
                  (pred_8 ?v6) (pred_11 ?v12 ?v6) (pred_3 ))
:effect (and (pred_2 ?v12)
   (not (pred_11 ?v12 ?v6)) (not (pred_3 ))))


(:action op_1
:parameters (?v6 ?v9 ?v13)
:precondition (and (pred_5 ?v6) (pred_7 ?v9) (pred_7 ?v13)
                  (pred_8 ?v6) (pred_2 ?v13) (pred_11 ?v9 ?v6))
:effect (and (pred_2 ?v9) (pred_11 ?v13 ?v6)
        (not (pred_2 ?v13)) (not (pred_11 ?v9 ?v6))))

(:action op_4
:parameters (?v6 ?v12)
:precondition (and (pred_5 ?v6) (pred_7 ?v12) 
                  (pred_8 ?v6) (pred_2 ?v12))
:effect (and (pred_3 ) (pred_11 ?v12 ?v6) (not (pred_2 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_02 obj_10 obj_07 obj_05 obj_09 obj_13 obj_04 obj_08 obj_03
    obj_11 obj_01
    obj_12 obj_06
    )

    (:init
       (pred_3)

       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_09)
       (pred_5 obj_13)
       (pred_5 obj_04)
       (pred_5 obj_08)
       (pred_5 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_7 obj_12)
       (pred_7 obj_06)

       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_07)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_07 obj_10)
       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_13 obj_03)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_04 obj_08)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_04)
       (pred_10 obj_03 obj_13)
       (pred_10 obj_03 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_05)
       (pred_9  obj_02 obj_11)
       (pred_9  obj_05 obj_01)
       (pred_1 obj_10)
       (pred_1 obj_07)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_08)
       (pred_1 obj_03)

       (pred_4  obj_12 obj_11)
       (pred_4  obj_06 obj_01)
       (pred_11 obj_12 obj_03)
       (pred_11 obj_06 obj_03)
       (pred_8 obj_08)
    )

    (:goal (and
       (pred_11 obj_06 obj_07)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_3 obj_08 obj_03)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_03)
   goals met: 0 of 1
2. (op_2 obj_03 obj_06)
   deleted: (pred_11 obj_06 obj_03) (pred_3)
   added: (pred_2 obj_06)
   goals met: 0 of 1
3. (op_3 obj_03 obj_08)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_08)
   goals met: 0 of 1
4. (op_3 obj_08 obj_09)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_09)
   goals met: 0 of 1
5. (op_3 obj_09 obj_10)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_10)
   goals met: 0 of 1
6. (op_3 obj_10 obj_07)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_07)
   goals met: 0 of 1
7. (op_4 obj_07 obj_06)
   deleted: (pred_2 obj_06)
   added: (pred_3) (pred_11 obj_06 obj_07)
   goals met: 1 of 1
